grevaillot/svd_tools/headers/ATSAMR35J17B/tc0.h
/** @defgroup tc0_count16_ctrla COUNT16CTRLA Control A
@{*/

/** TC0_COUNT16_CTRLA_COPEN1 Capture On Pin 1 Enable **/
#define TC0_COUNT16_CTRLA_COPEN1		(1 << 21)
/** TC0_COUNT16_CTRLA_COPEN0 Capture On Pin 0 Enable **/
#define TC0_COUNT16_CTRLA_COPEN0		(1 << 20)
/** TC0_COUNT16_CTRLA_CAPTEN1 Capture Channel 1 Enable **/
#define TC0_COUNT16_CTRLA_CAPTEN1		(1 << 17)
/** TC0_COUNT16_CTRLA_CAPTEN0 Capture Channel 0 Enable **/
#define TC0_COUNT16_CTRLA_CAPTEN0		(1 << 16)
/** TC0_COUNT16_CTRLA_ALOCK Auto Lock **/
#define TC0_COUNT16_CTRLA_ALOCK		(1 << 11)

#define TC0_COUNT16_CTRLA_PRESCALER_SHIFT		8
#define TC0_COUNT16_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tc0_count16_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** TC0_COUNT16_CTRLA_ONDEMAND Clock On Demand **/
#define TC0_COUNT16_CTRLA_ONDEMAND		(1 << 7)
/** TC0_COUNT16_CTRLA_RUNSTDBY Run during Standby **/
#define TC0_COUNT16_CTRLA_RUNSTDBY		(1 << 6)

#define TC0_COUNT16_CTRLA_PRESCSYNC_SHIFT		4
#define TC0_COUNT16_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tc0_count16_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization
@{*/
/**@}*/


#define TC0_COUNT16_CTRLA_MODE_SHIFT		2
#define TC0_COUNT16_CTRLA_MODE_MASK		0x03
/** @defgroup tc0_count16_ctrla_mode MODE Timer Counter Mode
@{*/
/**@}*/

/** TC0_COUNT16_CTRLA_ENABLE Enable **/
#define TC0_COUNT16_CTRLA_ENABLE		(1 << 1)
/** TC0_COUNT16_CTRLA_SWRST Software Reset **/
#define TC0_COUNT16_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_ctrla COUNT32CTRLA Control A
@{*/

/** TC0_COUNT32_CTRLA_COPEN1 Capture On Pin 1 Enable **/
#define TC0_COUNT32_CTRLA_COPEN1		(1 << 21)
/** TC0_COUNT32_CTRLA_COPEN0 Capture On Pin 0 Enable **/
#define TC0_COUNT32_CTRLA_COPEN0		(1 << 20)
/** TC0_COUNT32_CTRLA_CAPTEN1 Capture Channel 1 Enable **/
#define TC0_COUNT32_CTRLA_CAPTEN1		(1 << 17)
/** TC0_COUNT32_CTRLA_CAPTEN0 Capture Channel 0 Enable **/
#define TC0_COUNT32_CTRLA_CAPTEN0		(1 << 16)
/** TC0_COUNT32_CTRLA_ALOCK Auto Lock **/
#define TC0_COUNT32_CTRLA_ALOCK		(1 << 11)

#define TC0_COUNT32_CTRLA_PRESCALER_SHIFT		8
#define TC0_COUNT32_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tc0_count32_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/

/** TC0_COUNT32_CTRLA_ONDEMAND Clock On Demand **/
#define TC0_COUNT32_CTRLA_ONDEMAND		(1 << 7)
/** TC0_COUNT32_CTRLA_RUNSTDBY Run during Standby **/
#define TC0_COUNT32_CTRLA_RUNSTDBY		(1 << 6)

#define TC0_COUNT32_CTRLA_PRESCSYNC_SHIFT		4
#define TC0_COUNT32_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tc0_count32_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization
@{*/
/**@}*/


#define TC0_COUNT32_CTRLA_MODE_SHIFT		2
#define TC0_COUNT32_CTRLA_MODE_MASK		0x03
/** @defgroup tc0_count32_ctrla_mode MODE Timer Counter Mode
@{*/
/**@}*/

/** TC0_COUNT32_CTRLA_ENABLE Enable **/
#define TC0_COUNT32_CTRLA_ENABLE		(1 << 1)
/** TC0_COUNT32_CTRLA_SWRST Software Reset **/
#define TC0_COUNT32_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_ctrlbclr COUNT8CTRLBCLR Control B Clear
@{*/


#define TC0_COUNT8_CTRLBCLR_CMD_SHIFT		5
#define TC0_COUNT8_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tc0_count8_ctrlbclr_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT8_CTRLBCLR_ONESHOT One-Shot on Counter **/
#define TC0_COUNT8_CTRLBCLR_ONESHOT		(1 << 2)
/** TC0_COUNT8_CTRLBCLR_LUPD Lock Update **/
#define TC0_COUNT8_CTRLBCLR_LUPD		(1 << 1)
/** TC0_COUNT8_CTRLBCLR_DIR Counter Direction **/
#define TC0_COUNT8_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_ctrlbclr COUNT16CTRLBCLR Control B Clear
@{*/


#define TC0_COUNT16_CTRLBCLR_CMD_SHIFT		5
#define TC0_COUNT16_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tc0_count16_ctrlbclr_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT16_CTRLBCLR_ONESHOT One-Shot on Counter **/
#define TC0_COUNT16_CTRLBCLR_ONESHOT		(1 << 2)
/** TC0_COUNT16_CTRLBCLR_LUPD Lock Update **/
#define TC0_COUNT16_CTRLBCLR_LUPD		(1 << 1)
/** TC0_COUNT16_CTRLBCLR_DIR Counter Direction **/
#define TC0_COUNT16_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_ctrlbclr COUNT32CTRLBCLR Control B Clear
@{*/


#define TC0_COUNT32_CTRLBCLR_CMD_SHIFT		5
#define TC0_COUNT32_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tc0_count32_ctrlbclr_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT32_CTRLBCLR_ONESHOT One-Shot on Counter **/
#define TC0_COUNT32_CTRLBCLR_ONESHOT		(1 << 2)
/** TC0_COUNT32_CTRLBCLR_LUPD Lock Update **/
#define TC0_COUNT32_CTRLBCLR_LUPD		(1 << 1)
/** TC0_COUNT32_CTRLBCLR_DIR Counter Direction **/
#define TC0_COUNT32_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_ctrlbset COUNT8CTRLBSET Control B Set
@{*/


#define TC0_COUNT8_CTRLBSET_CMD_SHIFT		5
#define TC0_COUNT8_CTRLBSET_CMD_MASK		0x07
/** @defgroup tc0_count8_ctrlbset_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT8_CTRLBSET_ONESHOT One-Shot on Counter **/
#define TC0_COUNT8_CTRLBSET_ONESHOT		(1 << 2)
/** TC0_COUNT8_CTRLBSET_LUPD Lock Update **/
#define TC0_COUNT8_CTRLBSET_LUPD		(1 << 1)
/** TC0_COUNT8_CTRLBSET_DIR Counter Direction **/
#define TC0_COUNT8_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_ctrlbset COUNT16CTRLBSET Control B Set
@{*/


#define TC0_COUNT16_CTRLBSET_CMD_SHIFT		5
#define TC0_COUNT16_CTRLBSET_CMD_MASK		0x07
/** @defgroup tc0_count16_ctrlbset_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT16_CTRLBSET_ONESHOT One-Shot on Counter **/
#define TC0_COUNT16_CTRLBSET_ONESHOT		(1 << 2)
/** TC0_COUNT16_CTRLBSET_LUPD Lock Update **/
#define TC0_COUNT16_CTRLBSET_LUPD		(1 << 1)
/** TC0_COUNT16_CTRLBSET_DIR Counter Direction **/
#define TC0_COUNT16_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_ctrlbset COUNT32CTRLBSET Control B Set
@{*/


#define TC0_COUNT32_CTRLBSET_CMD_SHIFT		5
#define TC0_COUNT32_CTRLBSET_CMD_MASK		0x07
/** @defgroup tc0_count32_ctrlbset_cmd CMD Command
@{*/
/**@}*/

/** TC0_COUNT32_CTRLBSET_ONESHOT One-Shot on Counter **/
#define TC0_COUNT32_CTRLBSET_ONESHOT		(1 << 2)
/** TC0_COUNT32_CTRLBSET_LUPD Lock Update **/
#define TC0_COUNT32_CTRLBSET_LUPD		(1 << 1)
/** TC0_COUNT32_CTRLBSET_DIR Counter Direction **/
#define TC0_COUNT32_CTRLBSET_DIR		(1 << 0)

/**@}*/

