grevaillot/svd_tools/headers/ATSAMR35J17B/tc0.h
/** @defgroup tc0_count8_wave COUNT8WAVE Waveform Generation Control
@{*/


#define TC0_COUNT8_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT8_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count8_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_wave COUNT16WAVE Waveform Generation Control
@{*/


#define TC0_COUNT16_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT16_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count16_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_wave COUNT32WAVE Waveform Generation Control
@{*/


#define TC0_COUNT32_WAVE_WAVEGEN_SHIFT		0
#define TC0_COUNT32_WAVE_WAVEGEN_MASK		0x03
/** @defgroup tc0_count32_wave_wavegen WAVEGEN Waveform Generation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_drvctrl COUNT8DRVCTRL Control C
@{*/

/** TC0_COUNT8_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT8_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT8_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT8_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_drvctrl COUNT16DRVCTRL Control C
@{*/

/** TC0_COUNT16_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT16_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT16_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT16_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_drvctrl COUNT32DRVCTRL Control C
@{*/

/** TC0_COUNT32_DRVCTRL_INVEN1 Output Waveform Invert Enable 1 **/
#define TC0_COUNT32_DRVCTRL_INVEN1		(1 << 1)
/** TC0_COUNT32_DRVCTRL_INVEN0 Output Waveform Invert Enable 0 **/
#define TC0_COUNT32_DRVCTRL_INVEN0		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_dbgctrl COUNT8DBGCTRL Debug Control
@{*/

/** TC0_COUNT8_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT8_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_dbgctrl COUNT16DBGCTRL Debug Control
@{*/

/** TC0_COUNT16_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT16_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_dbgctrl COUNT32DBGCTRL Debug Control
@{*/

/** TC0_COUNT32_DBGCTRL_DBGRUN Run During Debug **/
#define TC0_COUNT32_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_syncbusy COUNT8SYNCBUSY Synchronization Status
@{*/

/** TC0_COUNT8_SYNCBUSY_CC1 Compare Channel 1 **/
#define TC0_COUNT8_SYNCBUSY_CC1		(1 << 7)
/** TC0_COUNT8_SYNCBUSY_CC0 Compare Channel 0 **/
#define TC0_COUNT8_SYNCBUSY_CC0		(1 << 6)
/** TC0_COUNT8_SYNCBUSY_PER Period **/
#define TC0_COUNT8_SYNCBUSY_PER		(1 << 5)
/** TC0_COUNT8_SYNCBUSY_COUNT Counter **/
#define TC0_COUNT8_SYNCBUSY_COUNT		(1 << 4)
/** TC0_COUNT8_SYNCBUSY_STATUS STATUS **/
#define TC0_COUNT8_SYNCBUSY_STATUS		(1 << 3)
/** TC0_COUNT8_SYNCBUSY_CTRLB CTRLB **/
#define TC0_COUNT8_SYNCBUSY_CTRLB		(1 << 2)
/** TC0_COUNT8_SYNCBUSY_ENABLE enable **/
#define TC0_COUNT8_SYNCBUSY_ENABLE		(1 << 1)
/** TC0_COUNT8_SYNCBUSY_SWRST swrst **/
#define TC0_COUNT8_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count16_syncbusy COUNT16SYNCBUSY Synchronization Status
@{*/

/** TC0_COUNT16_SYNCBUSY_CC1 Compare Channel 1 **/
#define TC0_COUNT16_SYNCBUSY_CC1		(1 << 7)
/** TC0_COUNT16_SYNCBUSY_CC0 Compare Channel 0 **/
#define TC0_COUNT16_SYNCBUSY_CC0		(1 << 6)
/** TC0_COUNT16_SYNCBUSY_PER Period **/
#define TC0_COUNT16_SYNCBUSY_PER		(1 << 5)
/** TC0_COUNT16_SYNCBUSY_COUNT Counter **/
#define TC0_COUNT16_SYNCBUSY_COUNT		(1 << 4)
/** TC0_COUNT16_SYNCBUSY_STATUS STATUS **/
#define TC0_COUNT16_SYNCBUSY_STATUS		(1 << 3)
/** TC0_COUNT16_SYNCBUSY_CTRLB CTRLB **/
#define TC0_COUNT16_SYNCBUSY_CTRLB		(1 << 2)
/** TC0_COUNT16_SYNCBUSY_ENABLE enable **/
#define TC0_COUNT16_SYNCBUSY_ENABLE		(1 << 1)
/** TC0_COUNT16_SYNCBUSY_SWRST swrst **/
#define TC0_COUNT16_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count32_syncbusy COUNT32SYNCBUSY Synchronization Status
@{*/

/** TC0_COUNT32_SYNCBUSY_CC1 Compare Channel 1 **/
#define TC0_COUNT32_SYNCBUSY_CC1		(1 << 7)
/** TC0_COUNT32_SYNCBUSY_CC0 Compare Channel 0 **/
#define TC0_COUNT32_SYNCBUSY_CC0		(1 << 6)
/** TC0_COUNT32_SYNCBUSY_PER Period **/
#define TC0_COUNT32_SYNCBUSY_PER		(1 << 5)
/** TC0_COUNT32_SYNCBUSY_COUNT Counter **/
#define TC0_COUNT32_SYNCBUSY_COUNT		(1 << 4)
/** TC0_COUNT32_SYNCBUSY_STATUS STATUS **/
#define TC0_COUNT32_SYNCBUSY_STATUS		(1 << 3)
/** TC0_COUNT32_SYNCBUSY_CTRLB CTRLB **/
#define TC0_COUNT32_SYNCBUSY_CTRLB		(1 << 2)
/** TC0_COUNT32_SYNCBUSY_ENABLE enable **/
#define TC0_COUNT32_SYNCBUSY_ENABLE		(1 << 1)
/** TC0_COUNT32_SYNCBUSY_SWRST swrst **/
#define TC0_COUNT32_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tc0_count8_count COUNT8COUNT COUNT8 Count
@{*/


#define TC0_COUNT8_COUNT_COUNT_SHIFT		0
#define TC0_COUNT8_COUNT_COUNT_MASK		0xff
/** @defgroup tc0_count8_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_count COUNT16COUNT COUNT16 Count
@{*/


#define TC0_COUNT16_COUNT_COUNT_SHIFT		0
#define TC0_COUNT16_COUNT_COUNT_MASK		0xffff
/** @defgroup tc0_count16_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_count COUNT32COUNT COUNT32 Count
@{*/


#define TC0_COUNT32_COUNT_COUNT_SHIFT		0
#define TC0_COUNT32_COUNT_COUNT_MASK		0xffffffff
/** @defgroup tc0_count32_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_per COUNT8PER COUNT8 Period
@{*/


#define TC0_COUNT8_PER_PER_SHIFT		0
#define TC0_COUNT8_PER_PER_MASK		0xff
/** @defgroup tc0_count8_per_per PER Period Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_cc%s COUNT8CC%s COUNT8 Compare and Capture
@{*/


#define TC0_COUNT8_CC%s_CC_SHIFT		0
#define TC0_COUNT8_CC%s_CC_MASK		0xff
/** @defgroup tc0_count8_cc%s_cc CC Counter/Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_cc%s COUNT16CC%s COUNT16 Compare and Capture
@{*/


#define TC0_COUNT16_CC%s_CC_SHIFT		0
#define TC0_COUNT16_CC%s_CC_MASK		0xffff
/** @defgroup tc0_count16_cc%s_cc CC Counter/Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_cc%s COUNT32CC%s COUNT32 Compare and Capture
@{*/


#define TC0_COUNT32_CC%s_CC_SHIFT		0
#define TC0_COUNT32_CC%s_CC_MASK		0xffffffff
/** @defgroup tc0_count32_cc%s_cc CC Counter/Compare Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_perbuf COUNT8PERBUF COUNT8 Period Buffer
@{*/


#define TC0_COUNT8_PERBUF_PERBUF_SHIFT		0
#define TC0_COUNT8_PERBUF_PERBUF_MASK		0xff
/** @defgroup tc0_count8_perbuf_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count8_ccbuf%s COUNT8CCBUF%s COUNT8 Compare and Capture Buffer
@{*/


#define TC0_COUNT8_CCBUF%s_CCBUF_SHIFT		0
#define TC0_COUNT8_CCBUF%s_CCBUF_MASK		0xff
/** @defgroup tc0_count8_ccbuf%s_ccbuf CCBUF Counter/Compare Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count16_ccbuf%s COUNT16CCBUF%s COUNT16 Compare and Capture Buffer
@{*/


#define TC0_COUNT16_CCBUF%s_CCBUF_SHIFT		0
#define TC0_COUNT16_CCBUF%s_CCBUF_MASK		0xffff
/** @defgroup tc0_count16_ccbuf%s_ccbuf CCBUF Counter/Compare Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_count32_ccbuf%s COUNT32CCBUF%s COUNT32 Compare and Capture Buffer
@{*/


#define TC0_COUNT32_CCBUF%s_CCBUF_SHIFT		0
#define TC0_COUNT32_CCBUF%s_CCBUF_MASK		0xffffffff
/** @defgroup tc0_count32_ccbuf%s_ccbuf CCBUF Counter/Compare Buffer Value
@{*/
/**@}*/


/**@}*/
